IDEA Open Model
LoadingULS Properties
Compatible with IDEA StatiCa 20.1
The LoadingULS type exposes the following members.
Properties
Name | Description
InternalForces
 Internal force in section (permanent for staged section)
InternalForces2ndOrder
 Internal forces of 2nd order effect
InternalForcesBegin
 Internal forces at the beginnig
InternalForcesEnd
 Internal forces at the end
InternalForcesImperfection
 Internal forces of imperfection effect
InternalForcesVariable
 Variable internal force in staged section only
Top
See Also
Reference
LoadingULS Class
IdeaRS.OpenModel.Concrete.Load Namespace